name: "phi_3_5_mini_instruct"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ -1, -1 ]  # Dynamic batch size and sequence length
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1 ]  # Dynamic output for logits
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU  # Ensure the model runs on CPU
  }
]

